Tekla.Structures.ModelInternal.dotFormingStates_t
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotFormingStates_t.DeformingType
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotFormingStates_t.FoldingType
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotFormingStates_t.WrappingType
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotFormingStates_t.ToStruct(Tekla.Structures.Forming.FormingStates)
FormingStates to dotFormingStates_t.
formingStates: Instance of FormingState class.

Tekla.Structures.ModelInternal.dotFormingStates_t.FromStruct(Tekla.Structures.Forming.FormingStates)
dotFormingStates_t to FormingStates.
formingStates: Instance of FormingState class.